{"entry":
[{"img" : "images/newImages/Fitness Boxing.jpg", "b": "Dec 5, 2023: Fitness Boxing Fist of the North Star Expansion Pack DLC Trailer for the Nintendo Switch", "p" : "Get ready to discover new modes, tracks, and costumes in Fitness Boxing Fist of the North Star! Test how many hits you can make in New Heart Mode or unleash your best punch in Raoh Mode!"}, 
  {"img": "images/newImages/Rocket League.jpg", "b": "Dec 5, 2023: Rocket League Season 13 Launch Trailer for the Nintendo Switch", "p": "Rocket League is ushering in a new season with Season 13 bringing the vibes of the 90s and early 2000s to the vehicular soccer game. Players will be able to unlock items in Rocket Pass Premium including two different Car Bodies including Ace and Primo. "},
  {"img": "images/newImages/LEGO fortnite.jpg", "b": "Dec 6, 2023: LEGO Fortnite Cinematic Trailer for the Nintendo Switch", "p": "Explore vast, open worlds where the magic of LEGO building and Fortnite collide! Collect food and resources, craft items, build shelter, and battle enemies solo or team up with up to seven friends."},
  {"img": "images/newImages/Outer Wilds.jpg", "b": "Dec 7, 2023: Outer Wilds: Archaeologist Edition Launch Trailer for the Nintendo Switch", "p": "Are you ready for lift off? Strap on your hiking boots, check your oxygen levels, and get ready to venture into space. Outer Wilds: Archaeologist Edition is now available on Nintendo Switch!"}
  {"img" : "images/newImages/Dave the Diver.jpg", "b": "Dec 7, 2023: Dave the Diver x Dredge Crossover Trailer for the Nintendo Switch", "p" : "Join Dave the Diver for a thrilling journey through the underwater world of Dredge, where you'll encounter unique aberrations and characters! Two of this year's acclaimed games are teaming up for an epic adventure!"},
  {"img" : "images/newImages/Prince of Persia.jpg", "b": "Dec 7, 2023: The Lost Crown Trailer Leak Reveals January Demo for the Nintendo Switch", "p" : "A new trailer for Prince of Persia: The Lost Crown has seemingly leaked, revealing a playable demo that will drop on January 1."},
  {"img" : "images/newImages/Palia.jpg", "b": "Dec 7, 2023: Palia Launches on the Nintendo Switch", "p" : "Explore a vibrant land full of wonder and charm as you build a life and home for yourself with Palia, a free-to-play cozy MMO game."}
]
}
