{"entry":[
  {"title":"The Lost Crown Trailer Leak Reveals January Demo for the Nintendo Switch", "img":"images/newImage/Prince of Persia.jpg", "text": "A new trailer for Prince of Persia: The Lost Crown has seemingly leaked, revealing a playable demo that will drop on January 1", "date": "12/07/2023"},
  {"title":"Dave the Diver x Dredge Crossover Trailer for the Nintendo Switch", "img":"images/newImage/Dave the Diver.JPG", "text": "Join Dave the Diver for a thrilling journey through the underwater world of Dredge, where you'll encounter unique aberrations and characters! Two of this year's acclaimed games are teaming up for an epic adventure!", "date": "12/07/2023"},
  {"title":"Outer Wilds: Archaeologist Edition Launch Trailer for the Nintendo Switch", "img":"images/newImage/Outer Wilds.jpg", "text": "Are you ready for lift off? Strap on your hiking boots, check your oxygen levels, and get ready to venture into space. Outer Wilds: Archaeologist Edition is now available on Nintendo Switch!", "date": "12/07/2023"},
  {"title":"LEGO Fortnite Cinematic Trailer for the Nintendo Switch", "img":"images/newImage/LEGO fortnite.JPG", "text": "Explore vast, open worlds where the magic of LEGO building and Fortnite collide! Collect food and resources, craft items, build shelter, and battle enemies solo or team up with up to seven friends.", "date": "12/06/2023"},
  {"title":"Fitness Boxing Fist of the North Star Expansion Pack DLC Trailer for the Nintendo Switch", "img":"images/newImage/Fitness Boxing.jpg", "text": "Get ready to discover new modes, tracks, and costumes in Fitness Boxing Fist of the North Star! Test how many hits you can make in New Heart Mode or unleash your best punch in Raoh Mode!", "date": "12/05/2023"},
  {"title":"A Highland Song Launch Trailer for the Nintendo Switch", "img":"images/newImage/A Highland Song.jpg", "text": "Teenager Moira McKinnon has one week to cross the wild Scottish Highlands, but there are hundreds of paths to explore, and every peak holds a secret. Explore every cave, ridge and valley as you make your way to the sea.", "date": "12/05/2023"},
  {"title":"Overwatch 2 Season 8: Call of the Hunt Trailer for the Nintendo Switch", "img":"images/newImage/Overwatch 2.JPG", "text": "Charge in guns blazin’ with the newest tank Hero, Mauga! Unlock new Beast Hunter themed skins in an all-new Battle Pass, go big or go home in the Battle of the Beasts event mode, and flex your hardware with all-new Weapon Skins!", "date": "12/04/2023"},
  {"title":"Fae Farm: Coasts of Croakia Announcement Trailer for the Nintendo Switch", "img":"images/newImage/Fae Farm.jpg", "text": "With the help of a new magical croaking friend, find your way to a whole new realm to explore, with exciting encounters and discoveries! This content update is free on Nintendo Switch.", "date": "12/04/2023"}
]}
