{"entry": [
  {"name": "Kim Snaith", "rating": "images/newImage/8star.png","date": "11.22.2023", "text": "Dredge: The Pale Reach Review: It’s simple. If you enjoyed Dredge, you’ll enjoy The Pale Reach. While this DLC doesn’t reinvent the wheel, it offers a solid reason to return to one of this year’s best indie games. It’s a fairly small expansion, but for a budget price you’re getting new mysteries to unravel, new fish to catch and a new area to explore. What more could you want?"},
  {"name": "Oliver Reynolds", "rating": "images/newImage/5star.png","date": "11.22.2023", "text": "Bluey: The Videogame Review: The game successfully emulates the look and feel of the iconic TV show, but unfortunately it fails to recapture the same family magic. The gameplay is incredibly repetitive across the one-to-two-hour experience, relying on locating items dotted around the five core environments. Minigames break up the monotony somewhat, but even these fail to maintain attention for too long. That said, young children are going to get a kick out of simply existing within this world and playing as their favourite Bluey characters. If that's all you're looking to get out of this game, this does a decent job. But when you compare it to the all-ages magic of the show itself, and other family-focused games on Switch, this falls well short of the source material."},
  {"name": "PJ O'Reilly", "rating": "images/newImage/6star.png","date": "11.22.2023", "text": "Jurassic Park Classic Games Collection Review: The Jurassic Park Classic Games Collection serves up seven slices of old-school dino action in a package that suffers from its focus on the 8- and 16-bit eras. Yes, it's great to have these old games all gathered up and available to play with some quality-of-life additions, you can't knock them too hard for being clunky by today's standards, and nostalgia may add a few points to the overall score below if you're an Isla Nublar mega-fan, but there's no avoiding the fact that the experiences here haven't aged particularly well."},
  {"name": "Tom Massey", "rating": "images/newImage/6star.png","date": "11.22.2023", "text": "Irem Collection Volume 1 Review: While its presentation is in some cases downright lacking, the Irem Collection Volume 1's essentials are at least in order, delivering three great games, several port variations, and enough adjustable options to satisfy. That said, both Image Fights are utter taskmasters that require a hardened disposition, and that limits their broader appeal. X Multiply makes up for this by being a lot more accessible, with a visually superb aesthetic, but also feels like the odd one out because of it. We can't help but feel an Irem Collection combining eight to ten titles would have been something worth shouting about, but with further volumes in the pipeline, this does feel like yet another exercise in squeezing a niche consumer base over several releases. Despite our appreciation of the games on board, it's hard to get too excited."},
  {"name": "Adrian Burrows", "rating": "images/newImage/2star.png","date": "11.23.2023", "text": "Flashback 2 Review: Visually, Flashback 2 is a blurry and overly busy mess, with objects blending into each other like an oil painting gone wrong. Nothing stands out, adding to the woes of aiming and shooting. Environments are small and basic, providing no sense of exploration, and that extends to the rather naff story as well, which is presented as nothing more than a series of dull, terribly scripted, poorly-voiced talking heads."},
  {"name": "Oliver Reynolds", "rating": "images/newImage/2star.png","date": "11.23.2023", "text": "The Walking Dead: Destinies Review: Publisher GameMill should be embarrassed at putting out The Walking Dead: Destinies at any price, let alone as a $50 boxed product, and we sincerely hope AMC Networks takes a bit more care in who it entrusts with its IP in the future. There's absolutely nothing here that has been executed well; it's a game that is simply rife with technical blunders, terrible production values, and broken mechanics. The only thing keeping Destinies from achieving a lower score is that you can at least play to the end credits, but even those have been fumbled. In a year filled with bonafide classics, Destinies is the worst game we've played."},
  {"name": "Mitch Vogel", "rating": "images/newImage/7star.png","date": "11.23.2023", "text": "ASTLIBRA Revision Review: Astlibra Revision may not be a truly great game, but it is most certainly an interesting one. At the very least, it is unafraid to challenge JRPG conventions in unique ways while also demonstrating mastery of the genre's most basic tropes. It can feel a little too archaic in its design and haphazard in its pacing, while the vaguely Flash game-esque visuals are a bit of a letdown. On the whole, though, it proves to be a worthwhile experience, one that we would especially recommend to fans of older RPGs. If you can look past its faults, there's a lot to love about Astlibra; we'd suggest you investigate if your interest is piqued."},
  {"name": "Alana Dunitz", "rating": "images/newImage/8star.png","date": "11.25.2023", "text": "Pixel Cafe Review: Pixel Cafe is a great “cosy” game, though at times, it feels like it’s too action-packed to be considered a relaxing and laid-back title. To keep all the customers happy, you will need to have fast reaction times to ensure you get the orders right and completed in a timely manner. The introduction of new machines and recipes is done at a reasonable rate so that you don’t get overwhelmed trying to learn too many new things at once, reminding me of games like Overcooked."},
  {"name": "Alex Olney", "rating": "images/newImage/8star.png","date": "11.27.2023", "text": "SteamWorld Build Review: SteamWorld Build is a beautifully crafted game that seamlessly blends genres and ideas into a polished and premium package. There's not another management sim like it, but despite it running surprisingly well on Nintendo's system, it does leave us wanting for more reason to return to it. You're all but guaranteed to adore your first time through, but subsequent playthroughs may not carry the same magic. Still, with all that being said, this is undeniably a triumph of mechanical marvellousness."},
  {"name": "Mitch Vogel", "rating": "images/newImage/6star.png","date": "11.28.2023", "text": "The Last Faith Review: Though it has its issues, The Last Faith feels like an overall welcome addition to the Switch's overstuffed Metroidvania and Soulslike libraries. Its tough combat, gothic aesthetic, and labyrinthine world all feel engaging, even if some of the upgrades feel underwhelming and performance can be rough. We'd recommend this to anyone who enjoyed either of the Blasphemous games or fans who can't get enough of the Soulsike formula-The Last Faith isn't the best example of this kind of gameplay, but it's an overall solid effort. However, we'd recommend investigating other platforms that can deliver better performance than Switch, if that's an option for you. Performance drops can really hurt the experience, so we've got our fingers crossed for further updates."},
  {"name": "Thomas Whitehead", "rating": "images/newImage/8star.png","date": "11.29.2023", "text": "Football Manager 2024 Review: Is Football Manager 2024 Touch on Switch the best way to experience the franchise this year? Probably not, in light of the various other versions and platforms available. However, it is a solid version of a strong entry in the series, with the convenience of being on Nintendo's marvellous little machine whether you want to play on the go or pop it up on the TV. It strips away some of the immersive depth from the 'main' version on PC, but adds interesting nuances of its own while keeping the experience snappy. If you can figure out the quirky physical controls, along with how to get your 4-3-2-1 formation humming, you can sink plenty of hours into this one."},
  {"name": "Justin Nation", "rating": "images/newImage/5star.png","date": "11.30.2023", "text": "Crashy Laps Review: If you’re a “vintage” gamer like me you’ll probably also have fond memories of isometric racers from the arcades along the lines of Super Sprint or even Ivan Stewart's Super Off Road. Though those worked well in the arcade they never really translated all that well to home systems for a variety of reasons. Crashy Laps, at a glance has the look of a new contender in the battle to try to make that style of play work on the Switch, and while it does have glimmers of potential at times, it’s hard to walk away feeling satisfied. The biggest problem isn’t with the controls which actually work reasonably well, but with the tracks and the specifics of how they’re implemented."},
  {"name": "Sammy Barker", "rating": "images/newImage/7star.png","date": "12.1.2023", "text": "Pinball M Review: Pinball M exists to provide Zen Studios with a venue to explore more mature material, but launching several months later than the underwhelming Pinball FX, it also fixes a lot of core structural problems with its peer. This is a more cohesive, rewarding package overall and the first batch of five tables are bloody fantastic to boot."},
  {"name": "Jordan Loades", "rating": "images/newImage/9star.png","date": "12.1.2023", "text": "TEVI Review: Though I have minor gripes, mostly concerning the early hours of my experience, such as some environments feeling basic or less enjoyable and the initial slower pace affecting combat, persisting through reveals the absolute gem that is Tevi. I had such a good time that I'm eager for a second playthrough, despite its lengthy runtime, taking dozens of hours to complete. After experiencing a metroidvania like Tevi, I wouldn't rabbit any other way."},
  {"name": "Kim Snaith", "rating": "images/newImage/8star.png","date": "12.4.2023", "text": "Make Way Review: Whether you’re having a gathering with your friends over the holidays or arranging an online games night, make sure Make Way is top of your playlist. This wonderful little game turns a very simple idea into a moreish, devilish and absolutely riotous multiplayer experience that will keep you coming back for more. It’s just a shame that not everything is unlocked at the outset so we can go full-on carnage right away, but we can’t have everything."},
  {"name": "Wil James", "rating": "images/newImage/7star.png","date": "12.5.2023", "text": "While The Iron’s Hot Review: While The Iron’s Hot does just about everything in its package well, it also never progresses any of its components into great territory. It offers an involved crafting process as its primary gameplay system that successfully engages you in feeling like a blacksmith, though the system does not evolve as your character hones his craft. Along with this, a fun adventure unfolds with eccentric characters and suitable change-of-pace activities."},
  {"name": "Kate Gray", "rating": "images/newImage/7star.png","date": "12.5.2023", "text": "A Highland Song Review: A Highland Song's folklore-infused adventure takes it to the extreme, as you pull its teen runaway Moira up and down the cliffs and mountains of the Scottish highlands, finding treasures, music, and magic along the way. But its repetitious nature wears away the joy of exploration, and further playthroughs are a struggle between the thrill of new discoveries and the tedium of having to retread old ground."},
  {"name": "Adrian Burrows", "rating": "images/newImage/6star.png","date": "12.6.2023", "text": "Born of Bread Review: Born of Bread may look unique but in reality, this is your run-of-the-mill action RPG. Some decent ideas can't disguise the formulaic ingredients on offer. In terms of bread, its more supermarkets' own than an artisanal sourdough. When it comes to bread-based games, you deserve butter."},
  {"name": "Mitch Vogel", "rating": "images/newImage/7star.png","date": "12.7.2023", "text": "Dragon Quest Monsters: The Dark Prince Review: Dragon Quest Monsters The Dark Prince is an enjoyable monster-catching RPG that combines charming visuals with addictive gameplay to make for a genuinely gripping experience, making it feel like the long wait since the last entry to leave Japan has been worth it. Even so, its general lack of ambition and struggles with performance issues hold it back from greatness-it's very good, but it's also definitely got its issues. If you're at all a fan of Dragon Quest or monster-catching RPGs, we'd suggest you pick this one up, though perhaps wait a few months to see if Square can sort out the worst of its performance issues."},
  {"name": "Justin Nation", "rating": "images/newImage/7star.png","date": "12.8.2023", "text": "Crystal Chip Collector e Review: Given the fact that there are plenty of puzzlers and platformers on the system, making for much tougher overall competition, it makes sense to shoot for making a game that’s a mixture of both instead. Puzzle platformers may have some representation, but aside from the number of competitors being lower I’d say there’s also a fair amount of potential variety in how you implement things. Crystal Chip Collector e has chosen a path where speed and precision, more than anything, are the focus."},
]}
